# -*- coding: utf-8 -*-
from langconv import *
import os
import os.path

# 输出一个文件夹下所有文件名
# 循环将每个文件的 简体转换为繁体
# 并写入本地文件




# 输出一个文件夹下所有文件名
def file_name(file_dir):
    files_list = []
    for root, dirs, files in os.walk(file_dir):
        # print(root)  # 当前目录路径
        # print(dirs)  # 当前路径下所有子目录
        # print(files)  # 当前路径下所有非目录子文件
        for file in files:
            files_list.append(file)
    return (files_list)

# 文件夹所在路径
dir = "D:\\pythonProject\\四库全书_清洗后\\子部"
files = file_name(dir)      # 该文件夹下所有文件名列表
print(files)

# '''



# 所有文件名
# 经部
# files = ['东坡易传,苏东坡.txt', '中庸章句,子思.txt', '中庸章句集注,朱熹.txt', '中论,徐干.txt', '仪礼,佚名.txt', '仪礼注疏,郑玄.txt', '周易,佚名.txt', '周易参同契,魏伯阳.txt', '周易正义,孔颖达.txt', '周易注,王弼.txt', '周易略例,王弼.txt', '周易郑康成注,王应麟.txt', '周易集解,李鼎祚.txt', '周礼,周公旦.txt', '周礼注疏,贾公彦.txt', '四书章句集注,朱熹.txt', '大学章句,孔子.txt', '大学章句集注,朱熹.txt', '大戴礼记,戴德.txt', '子夏易传,卜子夏.txt', '孝经,孔丘.txt', '孝经注疏,李隆基.txt', '孟子,孟轲.txt', '孟子字义疏证,戴东原.txt', '孟子注疏,赵岐.txt', '孟子集注,朱熹.txt', '尔雅,佚名.txt', '尔雅注疏,郭璞.txt', '尚书,孔丘.txt', '尚书大传,伏胜.txt', '尚书正义,孔安国.txt', '新本郑氏周易,恵栋.txt', '明夷待访录,黄宗羲.txt', '易传,.txt', '易童子问,欧阳修.txt', '春秋公羊传,公羊高.txt', '春秋公羊传注疏,何休.txt', '春秋左传,左丘明.txt', '春秋左传正义,杜预.txt', '春秋谷梁传,榖梁俶.txt', '春秋谷梁传注疏,范甯、杨士勋.txt', '毛詩,.txt', '泰泉乡礼,黄佐.txt', '深衣考误,江永.txt', '礼记,戴德.txt', '礼记正义,郑玄.txt', '论语,孔丘.txt', '论语注疏,何晏.txt', '论语集注,朱熹.txt', '诗经,.txt', '輶轩使者绝代语释别国方言,杨雄.txt', '释名,刘熙.txt', '陆氏易解,姚士粦.txt', '韩诗外传,韩婴.txt']

# 子部
files  = ['七修类稿,郎锳.txt', '三十六计,佚名.txt', '三命通会,万民英.txt', '三略,黄石公.txt', '不真空论,僧肇.txt', '与梁武帝论书启,陶弘景.txt', '世说新语,刘义庆.txt', '东坡志林,苏轼.txt', '两同书,罗隐.txt', '中医内科方剂索引,.txt', '中华古今注,马缟.txt', '中说,王通.txt', '临池管见,周星莲.txt', '临池诀,卢携.txt', '乐府杂录,段安节.txt', '九势,蔡邕.txt', '九章算术,张苍.txt', '书后品,李嗣真.txt', '书品[节录],庾肩吾.txt', '书学,钱泳.txt', '书学捷要[节录],朱履贞.txt', '书断,张怀瓘.txt', '书断列传,张怀瓘.txt', '书旨述,虞世南.txt', '书法散论,傅山.txt', '书法约言,宋曹.txt', '书法论,沈尹默.txt', '书法辑要,文伯子.txt', '书法雅言,项穆.txt', '书筏,笪重光.txt', '书论,.txt', '书论,欧阳询.txt', '书诀,丰坊.txt', '书述,李煜.txt', '乾坤大略,王余佑.txt', '了凡四训,袁了凡.txt', '二十四孝,郭居敬.txt', '二字诀,李华.txt', '云笈七签,张君房.txt', '五十六种书并序,韦续.txt', '五杂俎,谢肇淛.txt', '五灯会元,释普济.txt', '亢仓子,庚桑楚.txt', '人物志,刘邵.txt', '仇池笔记,苏轼.txt', '传习录,王守仁.txt', '伤寒论,张仲景.txt', '何博士备论,何去非.txt', '佛祖通载,释念常.txt', '佛说四十二章经,.txt', '作字示儿孙,傅山.txt', '傅青主女科,傅山.txt', '僧宝传,释惠洪.txt', '公孙龙子,公孙龙.txt', '六书缘起,孙光祖.txt', '六体书论,张怀瓘.txt', '六祖大师法宝坛经,法海.txt', '六韬(注释本),姜子牙.txt', '六韬,姜尚.txt', '关尹子,尹喜.txt', '兵制,黄宗羲.txt', '典论,曹丕.txt', '兼明书,丘光庭.txt', '农学古籍概览,.txt', '冷斋夜话,释惠洪.txt', '分甘馀话,王士禛.txt', '列仙传,刘向.txt', '列子,列御寇.txt', '列子集释,杨伯峻.txt', '刘子,刘昼.txt', '劉氏菊譜,劉蒙.txt', '勤有堂随录,陈栎.txt', '化书,谭峭.txt', '北山酒经,朱翼中.txt', '北溪字义,陈淳.txt', '北碑南帖论[节录],阮元.txt', '北苑別錄,趙汝礪(北宋).txt', '北苑别录,赵汝砺.txt', '医学源流论,徐大椿.txt', '医方集解,汪昂.txt', '十七史百将传,张预.txt', '十六湯品,蘇廙(唐).txt', '千金翼方,孙思邈.txt', '南北书派论[节录],阮元.txt', '南询录,邓豁渠.txt', '南越笔记,李调元.txt', '历代兵制,陈傅良.txt', '历代崇道记,杜光庭.txt', '厚黑学,李宗吾.txt', '古今书评,袁昂.txt', '古今刀剑录,陶宏景.txt', '古尊宿语录,僧赜藏.txt', '古方八阵,张景岳(明).txt', '古画品录,谢赫.txt', '司马法,司马穰苴.txt', '名贤集,佚名.txt', '吕氏春秋,吕不韦.txt', '吴子,吴起.txt', '周髀算经,佚名.txt', '呻吟语摘,吕坤.txt', '唐人咏茶诗,.txt', '唐李问对,阮逸.txt', '商君书,商鞅.txt', '四体书势,卫恒.txt', '围炉夜话,王永彬.txt', '图画见闻志,郭若虚.txt', '墨子,墨翟.txt', '墨子城守各篇简注,岑仲勉.txt', '墨子白话今译,.txt', '墨子闲诂,孙诒让.txt', '声律启蒙,李渔.txt', '备急千金要方,孙思邈.txt', '夜航船,张岱.txt', '大明水記,歐陽脩(北宋).txt', '大观茶论,赵佶.txt', '天工开物,宋应星.txt', '天玉经,杨筠松.txt', '太上感应篇,(宋)李昌龄.txt', '太平经合校,于吉.txt', '太玄经,杨雄.txt', '太白阴经,李筌.txt', '奇经八脉考,李时珍.txt', '奴书订,祝允明.txt', '孔丛子,孔鲋.txt', '孔子家语,王肃.txt', '孙子兵法,孙武.txt', '孙子略解,曹操.txt', '孙子算经,佚名.txt', '孙膑兵法,孙膑.txt', '孙过庭书谱及其释文,孙过庭.txt', '宅经,.txt', '守城录,陈规.txt', '宋高僧传,赞宁.txt', '定州汉墓竹简《论语》,孔丘.txt', '宣和北苑貢茶錄,熊蕃(宋).txt', '宣和北苑贡茶录,熊蕃.txt', '家范 (全译评点本),司马光.txt', '容斋续笔,洪迈.txt', '容斋随笔,洪迈.txt', '寓简,沈作喆.txt', '封氏闻见记,封演.txt', '将苑,诸葛亮.txt', '尉繚子,尉缭.txt', '小儿语,吕得胜.txt', '小学诗,谢泰阶.txt', '尹文子,尹喜.txt', '居易录,王士禛.txt', '岕茶汇抄,冒襄.txt', '帛书《黃帝四经》,.txt', '帝范,李世民.txt', '广弘明集,道宣.txt', '广艺舟双楫,康有为.txt', '庄子,庄周.txt', '庄子·内篇,庄周.txt', '庄子集解,王先谦.txt', '庄子集释,郭庆藩.txt', '开元释教录,智升.txt', '弘明集,释侩佑.txt', '张子正蒙,张载.txt', '心经,真德秀.txt', '忍经,(元)吴亮.txt', '忠经,(汉)马融.txt', '慎子,慎到.txt', '扬子法言,汉·扬雄  晋·李轨 注.txt', '扬州画舫录,李斗.txt', '承晋斋积闻录,梁巘.txt', '投笔肤谈,西湖逸士.txt', '折狱龟鉴,郑克.txt', '抱朴子内篇,葛洪.txt', '抱朴子外篇,葛洪.txt', '拾遗记,(前秦)王嘉.txt', '授笔要说,韩方明.txt', '握奇经,公孙宏.txt', '撼龙经,杨筠松.txt', '散论,于右任.txt', '敬斋古今黈,李冶.txt', '文子,辛銒.txt', '新书,贾谊.txt', '新序,刘向.txt', '新語(简繁对照),陆贾.txt', '新论,桓谭.txt', '新语,陆贾.txt', '无能子,无能子.txt', '无量寿经,(三国魏)康僧铠译.txt', '日知录,顾炎武.txt', '日闻录,李翀.txt', '明夷待访录,黄宗羲.txt', '明季三朝野史,顾炎武.txt', '春秋穀梁传注疏,范宁.txt', '春秋繁露,董仲舒.txt', '春雨杂述,解缙.txt', '景岳全书,张介宾.txt', '智囊全集,冯梦龙.txt', '月波洞中记,郑樵.txt', '本草纲目,李时珍.txt', '朱子治家格言,朱柏庐.txt', '朱子语类,朱熹.txt', '東茶記,全義李.txt', '東茶頌,.txt', '板桥杂记,余怀.txt', '林泉高致集,郭思.txt', '林间录,释惠洪.txt', '桔中秘叙,.txt', '梅花谱,.txt', '梦溪笔谈,沈括.txt', '棋经,张拟.txt', '棋经十三篇,张拟.txt', '棋经论,.txt', '棠阴比事,桂万荣.txt', '橘录,韩彦直.txt', '武侯八阵兵法辑略,汪宗沂.txt', '武经总要,曾公亮.txt', '永历实录,王夫之.txt', '氾胜之书,氾胜之.txt', '池北偶谈,王士禛.txt', '法书要录-六卷全,张彦远.txt', '法书论,萧衍.txt', '法书论,蔡希综.txt', '法苑珠林,道世.txt', '法言义疏,杨雄.txt', '洗冤集录,宋慈.txt', '洛阳牡丹记,欧阳修.txt', '海岳名言,米芾.txt', '淮南子,刘安.txt', '清人原著——书法秘诀,.txt', '清代名人轶事,葛虚存.txt', '清代野记,梁溪坐观老人.txt', '清稗琐缀,佚名.txt', '温热论,叶桂.txt', '潜夫论笺校正,王符.txt', '濒湖脉学,李时珍.txt', '灵城精义,何溥.txt', '灵枢,.txt', '煮泉小品,田艺蘅.txt', '爱日斋丛抄,叶釐.txt', '物不迁论,僧肇.txt', '用笔法,钟瑶.txt', '甲申朝事小纪,王朝.txt', '申子,申不害.txt', '申鉴,荀悦.txt', '画禅室随笔,董其昌.txt', '画继,邓椿.txt', '痧胀玉衡,郭士遂.txt', '白虎通义,班固.txt', '百战奇略,刘基.txt', '益州名画录,黄休复.txt', '盐铁论,桓宽.txt', '知言,胡宏.txt', '碧岩录,释圆悟.txt', '神仙传,葛洪.txt', '神农本草经,佚名.txt', '神异经,东方朔.txt', '禽经,张华.txt', '禾谱,曾安止.txt', '笑林广记,游戏主人.txt', '笔意赞,王僧虔.txt', '笔阵图,卫铄.txt', '笔髓论,虞世南.txt', '笠翁对韵,李渔.txt', '算学启蒙总括,朱世杰.txt', '管子,管仲.txt', '管子轻重篇新诠,马非百.txt', '类证治裁,林佩琴.txt', '素书,黄石公.txt', '素问,.txt', '练兵实纪,戚继光.txt', '续书断,朱长文.txt', '续书谱,姜夔.txt', '缉古算经,王孝通.txt', '罗湖野录,晓莹.txt', '翠微先生北征录,华岳.txt', '翠微北征录,华岳.txt', '翰墨志,赵构.txt', '翰林要诀,陈绎曾.txt', '老子想尔注,张陵.txt', '老子道德经(英译本)Lao Tze,李耳.txt', '老子道德经校释,老子.txt', '老子集注,落花散人.txt', '老学庵笔记,陆游.txt', '脉经,王叔和.txt', '脉象口诀歌,佚名.txt', '艺概[节录],刘熙载.txt', '艺舟双辑（附《十七帖》疏证）,包世臣.txt', '茶录,蔡襄.txt', '茶疏,许次纾.txt', '茶神傳,艸衣.txt', '茶经,陆羽.txt', '茶譜,朱權(明).txt', '茶賦  幷書,寒齋.txt', '茶錄,蔡襄(北宋).txt', '荀子,荀况.txt', '草书势(含今译),崔瑗.txt', '草书势,索靖.txt', '药性赋,佚名.txt', '菜根谭,洪应明.txt', '葬书,郭璞.txt', '虎钤经,许洞.txt', '血證論,.txt', '衍极并注,郑杓.txt', '袁氏世范,袁采.txt', '褚氏遗书,褚澄.txt', '西征随笔,汪景祺.txt', '西铭,张载.txt', '言兵事疏,晁错.txt', '言行龟鉴,张光祖.txt', '训蒙骈句,司守谦.txt', '论书,王僧虔.txt', '论书,苏轼.txt', '论书,蔡襄.txt', '论书,释亚栖.txt', '论书,黄庭坚.txt', '论书表,江式.txt', '论书表,虞龢.txt', '论法书,董其昌.txt', '论用笔十法,张怀瓘.txt', '论衡,王充.txt', '论语(英译本),.txt', '评书,祝允明.txt', '评书药石论（含今译）,张怀瓘.txt', '试笔,欧阳修.txt', '说文解字,许慎.txt', '说苑,刘向.txt', '读书分年日程,程端礼.txt', '谐铎,沈起凤.txt', '象棋十诀,.txt', '象棋指归,贾题韬.txt', '负暄野录,陈槱.txt', '近思录,吕祖谦.txt', '述张长史笔法十二意,颜真卿.txt', '送高闲上人序,韩愈.txt', '通玄真经,辛銒.txt', '道德经（老子）,老子.txt', '邓子,邓析.txt', '邓析子,.txt', '酒经,(宋)朱肱.txt', '醫學三字經,.txt', '采古来能书人名,羊欣.txt', '释怀素与颜真卿论草书,陆羽.txt', '释氏稽古略,觉岸.txt', '金人铭,.txt', '金刚经集注,(明)朱棣主编.txt', '金匮要略,张机.txt', '金楼子,萧绎.txt', '鉴略妥注,李廷机.txt', '针邪密要,佚名.txt', '钝吟书要[节录],冯班.txt', '铜人针灸经,佚名.txt', '长短经,(唐)赵蕤.txt', '长短经（反经）,赵蕤.txt', '阳羡茗壶系,周高起.txt', '陆贾新语注释,江津 王利器.txt', '随园食单,袁枚.txt', '隶书体,成公绥.txt', '难经,杨玄操.txt', '青囊奥语,杨筠松.txt', '非草书,赵壹.txt', '韩非子,韩非.txt', '颅囟经,卫汛.txt', '题卫夫人笔阵图后,王羲之.txt', '题跋176则,苏轼.txt', '颜氏家训,颜之推.txt', '颜氏家训集解,王利器.txt', '风俗通义校注,应劭.txt', '鬼谷子,王诩.txt', '鬼谷子本经阴符七术,鬼谷子.txt', '鬼门十三针,佚名.txt', '鹖冠子,陆佃.txt', '鹤林玉露,罗大经.txt', '麈史,王得臣.txt', '黄帝内经,.txt', '黄帝阴符经,黄帝.txt', '齐东野语,周密.txt', '齐民要术,贾思勰.txt']

# print(files)

'''

# 直接 read() 每个文件
# 循环text 标准化为 繁体 utf-8
for file in files:
    # text名字
    title = file
    print(title)

    # 打开一个文件f
    f = open('D:\\pythonProject\\四库全书_清洗后\\史部\\%s' % title, 'r', encoding='utf-8')
    str = f.read()
    # print(str)

    # 将简体转换为繁体
    str = Converter('zh-hant').convert(str)
    str.encode('utf-8')

    # 清洗数据 去掉空格、换行
    str = str.replace(' ', '')
    # str = str.replace('\n', '')
    str = str.replace('　', '')
    str = str.replace(' ', '')
    # str = str.replace('□', '')

    # print(str)

    print(title)

    #   w在文件开始写入   a在文件末尾写入
    fb = open('D:\\pythonProject\\四库全书_标准化\\史部\\%s' % title, 'w', encoding='utf-8')
    fb.write(str)

    f.close()
    fb.close()

    print(title + "简转繁完成")

# '''

# '''

# 使用readlines() 读取每个文件
# 循环text 标准化为 繁体 utf-8    readlines()

for file in files:
    # text名字
    title = file
    print(title)

    # 打开一个文件f     rU 要求文件必须存在 且 按行进行分割
    f = open('D:\\pythonProject\\四库全书_清洗后\\子部\\%s' % title, 'rU', encoding='utf-8')
    # 按行读取文件 并进行操作
    try:
        for line in f:
            # do_somthing_with(line) // line带"\n"
            # 简体转换为繁体
            line = Converter('zh-hant').convert(line)
            line.encode('utf-8')

            # 清洗数据 去掉空格、换行
            line = line.replace(' ', '')
            # str = str.replace('\n', '')
            line = line.replace('　', '')
            line = line.replace(' ', '')
            # str = str.replace('□', '')

            # 将简体转换为繁体
            line = Converter('zh-hant').convert(line)
            line.encode('utf-8')

            #   w在文件开始写入   a在文件末尾写入
            fb = open('D:\\pythonProject\\四库全书_标准化\\子部\\%s' % title, 'a', encoding='utf-8')
            fb.write(line)

    finally:
        f.close()
        fb.close()

        print(title + "简转繁完成")


# '''




